{"lines": [{"value": -70, "state": "Resting State"}, {"value": -55, "state": "Threshold Potential"}, {"value": 40, "state": "Action Potential"}, {"value": -90, "state": "Refractory Period"}], "points": [{"Time": 0, "Voltage": -70, "Description": "Resting State"}, {"Time": 1, "Voltage": -70, "Description": "Stimulus Applied"}, {"Time": 1.5, "Voltage": -55, "Description": "Threshold Potential"}, {"Time": 2, "Voltage": 40, "Description": "Action Potential"}, {"Time": 2.5, "Voltage": -40, "Description": "Repolarization"}, {"Time": 3, "Voltage": -70, "Description": "Repolarization"}, {"Time": 3.5, "Voltage": -90, "Description": "Refractory Period"}, {"Time": 4, "Voltage": -80, "Description": "Refractory Period"}, {"Time": 4.5, "Voltage": -75, "Description": "Refractory Period"}, {"Time": 5, "Voltage": -70, "Description": "Resting State"}], "text": {"dendrite": {"header": "Dendrite Branches", "body": "A neuron receives signals through a series of branching, tree-like structures called Dendrites. These are stimulated by neurotransmitters - such as Dopamine, Oxytocin and Serotonin - and funnel that stimulation to the Axon Hillock, shown here."}, "fire": {"header": "Activation Achieved!", "body": "Once the voltage reaches Action Potential at positive 40 mV, the Axon Hillock fires a wave of ions down the axon, sending a signal to the Terminal Buttons."}, "neuron": {"header": "The Neuron Cell", "body": "This diagram shows the steps of a neuron reaching Action Potential. Click each part of the neuron activation cycle to learn more! Click 'Learn!' again to reset."}, "ion": {"header": "Sodium Ions", "body": "As neurotransmitters like dopamine and serotonine stimulate the dendrite branches, they open channels on the branches. Ions flood the dendrite through these channels and collect in the Axon Hillock."}, "terminal": {"header": "Terminal Buttons", "body": "After a signal is sent, it triggers the release of neurotransmitters through another series of branching structures called Terminal Buttons. These form joints, or synapses, with the dendrites of other neurons."}, "hillock": {"header": "Axon Hillock", "body": "As more and more ions collect, the voltage at the Axon Hillock increases from resting -70 mV. Once it reaches Threshold Potential, at -55 mV, the axon becomes more sensitive, and the voltage increases much more quickly."}, "cascade": {"header": "Neurotransmitters Released", "body": "Once the ion charge wave reaches the other side of the axon, it triggers a massive chemical cascade that releases more neurotransmitters to other dendritic branches. Meanwhile, in the Axon Hillock, the voltage rebounds down to -90 mV. This period is called the Refractory Period. This makes it harder for the neuron to fire for a brief period, until it rebalances to the resting potential of -70."}, "glial": {"header": "Myelin Sheath", "body": "Along the axon body, smaller cells called Schwann cells wrap around the axon. These myelin sheaths provide structural support to the neuron and insulate the axon, allowing signals to travel farther."}, "axon": {"header": "The Axon", "body": "This is the axon body. When the neuron fires, the signal travels along the length of the Axon body."}, "channel": {"header": "Voltage-Gated Sodium-Potassium Pumps", "body": "Without added boosts along the way, the chemical wave of ions in the axon body would never travel the length of the neuron - some human neurons can be several feet long! So, in between the glial cells, the axon body is covered in more sodium ion channels. When the wave reaches the channels, more ions flood in, boosting the wave along the next interval."}, "freeze": {"header": "Close-Up Look", "body": "Click on the highlighted images to learn more about each part of the Neuron Fire event. Double-click to close the window."}}}